; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-3-1-8-1)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos1-0 pos1-1 pos1-2 pos2-0 pos2-1 pos2-2
    shape0
    key0 key1 key2 key3 key4 key5 key6 key7
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (shape shape0)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)
       (key key6)
       (key key7)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-1)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (locked pos2-2)
       (lock-shape  pos2-2 shape0)
       (open pos0-0)
       (open pos0-1)
       (open pos0-2)
       (open pos1-0)
       (open pos1-1)
       (open pos1-2)
       (open pos2-0)
       (open pos2-1)

       (key-shape  key0 shape0)
       (key-shape  key1 shape0)
       (key-shape  key2 shape0)
       (key-shape  key3 shape0)
       (key-shape  key4 shape0)
       (key-shape  key5 shape0)
       (key-shape  key6 shape0)
       (key-shape  key7 shape0)
       (at key0 pos2-1)
       (at key1 pos1-0)
       (at key2 pos2-2)
       (at key3 pos0-1)
       (at key4 pos1-1)
       (at key5 pos0-2)
       (at key6 pos1-1)
       (at key7 pos1-2)
       (at-robot pos1-2)
    )

    (:goal (and
       (at key1 pos1-2)
       (at key5 pos1-1)
       (at key7 pos0-1)
    )))

; plan
1. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 0 of 3
2. (pickup pos0-2 key5)
   deleted: (at key5 pos0-2) (arm-empty)
   added: (holding key5)
   goals met: 0 of 3
3. (move pos0-2 pos0-1)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-1)
   goals met: 0 of 3
4. (move pos0-1 pos1-1)
   deleted: (at-robot pos0-1)
   added: (at-robot pos1-1)
   goals met: 0 of 3
5. (putdown pos1-1 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos1-1)
   goals met: 1 of 3
6. (move pos1-1 pos1-0)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-0)
   goals met: 1 of 3
7. (pickup pos1-0 key1)
   deleted: (at key1 pos1-0) (arm-empty)
   added: (holding key1)
   goals met: 1 of 3
8. (move pos1-0 pos1-1)
   deleted: (at-robot pos1-0)
   added: (at-robot pos1-1)
   goals met: 1 of 3
9. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 1 of 3
10. (pickup-and-loose pos1-2 key7 key1)
   deleted: (holding key1) (at key7 pos1-2)
   added: (holding key7) (at key1 pos1-2)
   goals met: 2 of 3
11. (move pos1-2 pos0-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos0-2)
   goals met: 2 of 3
12. (move pos0-2 pos0-1)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-1)
   goals met: 2 of 3
13. (pickup-and-loose pos0-1 key3 key7)
   deleted: (holding key7) (at key3 pos0-1)
   added: (holding key3) (at key7 pos0-1)
   goals met: 3 of 3
